year = int(input("Какой сейчас год?"))
user_data = int(input("Каков твой стаж?"))
stage_1 = int(input("В каком году ты родился?"))
stage_0 =int(year - stage_1)

if stage_0 <= 18:
    print("Ты не годен к призыву!")
else:
 print("Ты уже годен к призыву!")

print("Ты работаешь с " ,2021 - user_data, "года.")

stage_2 = (year - user_data)

if user_data >=5:
    print("Тебе пора менять работу!")
else: print('Ты что, гедонист?')

stage_3 = ((stage_1 - stage_2 )*(-1))
print("Ты не работал",stage_3, "лет своей жизни.")

stage_4 = (stage_1 + 65)
stage_5 = stage_4 - year
print("Год выхода на пенсию:",stage_4,"лет.", "Тебе осталось работать:", stage_5,"лет.")

print("--------------------------------------------------------------------------------")

print("ЗАДАЧА 1")

name = input("Введите свое имя:")
fingers = int(input("Введите актуальное количество пальцев на Ваших руках и ногах:"))

print(name,",")

if fingers < 20:
    print("cочувствую")
else: print("ты читал и подписывал требования безопасности!")

print("--------------------------------------------------------------------------------")

print("ЗАДАЧА 2")

time = int(input("Запиши время в секундах!"))
hour = time // 3600
min = (time - hour * 3600) // 60
sec = time - (hour * 3600 + min * 60)
print(f"Время на обычных часах: {hour} : {min} : {sec}")

print("--------------------------------------------------------------------------------")

print("ЗАДАЧА 3")


